{
    "explorer": {
        "title": "Документация"
    },
    "editor": {
        "variables": "Переменные",
        "headers": "Заголовки"
    },
    "buttons": {
        "reload": "Перезагрузить",
        "openDocumentation": "Открыть документацию"
    },
    "auth": {
        "pageLogin-1": "Если у вас нет аккаунта,",
        "pageLogin-2": "создайте учетную запись",
        "pageRegistr-1": "Если у вас есть учетная запись, пожалуйста,",
        "pageRegistr-2": "войдите",
        "login": "Войти",
        "createAccount": "Создать аккаунт",
        "errorEmail": "Хммм, пользователь с текущим адресом электронной почты не найден",
        "errorPassword": "Ой, ваш пароль неверный",
        "signIn": "Войти",
        "signUp": "Зарегистрироваться",
        "signOut": "Выйти",
        "errorUsedPassword": "Хммм, текущий адрес электронной почты уже используется",
        "errorEmpty": "Это поле не должно быть пустым",
        "errorShort": "Значение этого поля слишком короткое",
        "errorLong": "Значение этого поля слишком длинное",
        "errorWrongValue": "Неверное значение",
        "errorUnknown": "Неизвестная ошибка"
    },
    "notFound": {
        "text": "Отличный выстрел. Один на миллион.",
        "button": "Давай доставим тебя домой"
    },
    "welcome": {
        "title": "Добро пожаловать в далекий-далекий StarWars GraphQl",
        "button": "Прыжок на главную",
        "about": "Описание",
        "developers": "Разработчики"
    },
    "welcomeAccordion": {
        "project": "Проект",
        "course-1": "Курс",
        "course-2": "RS School React курс",
        "course-3": "Курс React бесплатный и онлайн!",
        "text-1": "GraphQl StarWars Explorer",
        "text-2": "Представляем проект GraphQl StarWars Explorer — восхитительное путешествие, в котором разработчики смогут исследовать бескрайние просторы вселенной «Звездных войн» всего несколькими нажатиями клавиш!",
        "text-3": "Представьте, что вы владеете мощью GraphQL, рыцаря-джедая среди языков запросов API, и погружаетесь в галактику, наполненную космическими кораблями, дроидами и световыми мечами. С этим проектом вы почувствуете себя библиотекарем-джедаем, без труда перемещающимся по сокровищнице данных «Звездных войн».",
        "text-4": "Исследуйте таких персонажей, как Люк Скайуокер, Дарт Вейдер и Йода, с грацией кореллианского контрабандиста, плавно перемещаясь по их связям, от их принадлежности до их знаковых цитат. Хотите знать, в каких фильмах появлялся R2-D2? Просто вызовите Силу GraphQL, чтобы мгновенно получить ответ. Но это еще не все!",
        "text-5": "Этот проект предлагает больше поворотов, чем хвост хатта. Это позволяет вам узнавать подробности о космических кораблях, планетах, видах и даже всегда популярном вступительном ролике каждого фильма «Звездные войны». Вы почувствуете себя протокольным дроидом, свободно владеющим более чем шестью миллионами видов развлечений.",
        "text-6": "Итак, примите участие в проекте GraphQl StarWars Explorer, где коддинг встречается с Силой. Это причудливое приключение, в котором вы сразу же скажете: «Да пребудут с вами запросы» и засмеетесь, как веселый Вуки.",
        "text-7": "Курс RS School React работает по принципу «плати потом». Члены нашего сообщества бесплатно делятся своими знаниями и проверяют задания учащихся. И мы надеемся, что наши студенты продолжат эту работу в качестве наших наставников в будущем.",
        "text-8": "Учиться в RS School может каждый, независимо от возраста, профессиональной занятости и места жительства. Тем не менее, вы должны иметь достаточные базовые знания до начала программы.",
        "text-9": "После завершения обучения студенты получают электронный сертификат об окончании."
    },
    "welcomeSlider": {
        "text-1": "Представляем разработчиков проекта, разношерстную команду владеющих кодом бунтарей и технически подкованных негодяев! С их пальцами, летящими по клавиатуре на гиперскорости, они создают проект, более мощный, чем армия астромеханических дроидов, и более забавный, чем неуклюжесть Джа-Джа Бинкса.",
        "text-2": "Разработчица, работающая в секретной организации, противостоящей злому императору. Она может писать код на разных языках, включая языки дроидов и вуки. У нее также есть сила, которая позволяет ей удаленно общаться с другими разработчиками и влиять на их решения. Она не боится столкнуться с трудностями и ошибками и всегда готова прийти на помощь своим коллегам.",
        "text-3": "Может писать код быстрее, чем Хан Соло, может спарсить GraphQl схему меньше, чем за двенадцать попыток — впечатляет даже для пилота «Тысячелетнего сокола»! Как и в случае с R2-D2, о навыках устранения неполадок этого разработчика ходят легенды. Как и Оби-Ван Кеноби, этот разработчик умеет наставлять и направлять младших членов команды, превращая их в рыцарей-джедаев в мире кодирования.",
        "text-4": "Обладает силой, которая позволяет ему взламывать любые системы безопасности и управлять различными механизмами. Он не боится столкнуться с трудностями и ошибками и всегда готов прийти на помощь своим друзьям. Он мечтает создать программу, способную уничтожить звезду смерти — главное оружие императора."
    },
    "error": {
        "errorMainText": "Упс... Что-то пошло не так.",
        "variablesError": "Ошибка переменных",
        "wrongObjectOfVariables": "Недопустимый объект переменных",
        "headersError": "Ошибка заголовков",
        "errorAuthBearer": "Заголовок Авторизация должен начинаться с Bearer",
        "errorShortAuth": "Токен в заголовке Authorization должен быть длиннее 10 символов",
        "errorLongAuth": "Токен в заголовке Authorization должен быть короче 20 символов",
        "errorAccessControlOr": "Неверный заголовок Access-Control-Allow-Origin",
        "errorAccessControlCr": "Неверный заголовок Access-Control-Allow-Credentials",
        "errorAccept": "Неверный заголовок Accept"
    }
}
