{
    "explorer": {
        "title": "Дакументацыя"
    },
    "editor": {
        "variables": "Зменныя",
        "headers": "Загалоўкі"
    },
    "buttons": {
        "reload": "Перазагрузіць",
        "openDocumentation": "Адкрыць дакументацыю"
    },
    "auth": {
        "pageLogin-1": "Калі ў вас няма акаўнта, ",
        "pageLogin-2": "стварыце ўліковы запіс",
        "pageRegistr-1": "Калі ў вас ёсць уліковы запіс, калі ласка, ",
        "pageRegistr-2": "увайдзіце",
        "login": "Увайсці",
        "createAccount": "Cтварыць уліковы запіс",
        "errorEmail": "НХм, карыстальнік з бягучай электроннай поштай не знойдзены",
        "errorPassword": "На жаль, ваш пароль няправільны",
        "signIn": "Увайсці",
        "signUp": "Зарэгістравацца",
        "signOut": "Выйсці"
    },
    "notFound": {
        "text": "Выдатны ўдар. Гэта быў адзін з мільёна.",
        "button": "Давайце даставім вас дадому"
    },
    "welcome": {
        "text": "Вітаем у StarWars GraphQl далёка-далёка",
        "button": "Адкрыць галоўную старонку",
        "about": "Aпісанне",
        "developers": "Распрацоўшчыкі"
    },
    "welcomeAccordion": {
        "project": "Праект",
        "text-1": "Праваднiк GraphQl StarWars",
        "text-2": "Прадстаўляем праект GraphQl StarWars Explorer, цудоўнае падарожжа, у якім распрацоўшчыкі могуць перасякаць велізарныя прасторы сусвету Star Wars усяго за некалькі націсканняў клавіш!",
        "text-3": "Уявіце, што вы валодаеце магутнасцю GraphQL, рыцара-джэдая сярод моў запытаў API, паглыбляючыся ў галактыку, напоўненую касмічнымі караблямі, дроідамі і светлавымі мячамі. З гэтым праектам вы адчуеце сябе бібліятэкарам-джэдаем, які лёгка перамяшчаецца па скарбніцы даных Star Wars.",
        "text-4": "Даследуйце такіх персанажаў, як Люк Скайуокер, Дарт Вейдэр і Ёда, з грацыяй карэліянскага кантрабандыста, бесперашкодна перасякаючы іх сувязі, ад іх прыналежнасці да іх знакавых цытат. Хочаце ведаць, у якіх фільмах здымаўся R2-D2? Проста выклічце Сілу GraphQL, каб імгненна атрымаць адказ. Але гэта яшчэ не ўсё!",
        "text-5": "Гэты праект прапануе больш паваротаў, чым хвост Хата. Гэта дазваляе вам раскапаць падрабязную інфармацыю пра зоркалёты, планеты, віды і нават заўсёды папулярны ўступны фрагмент кожнага фільма 'Зорныя войны'. Вы адчуеце сябе пратакольным дроідам, які свабодна валодае больш чым шасцю мільёнамі забаўляльных ведаў.",
        "text-6": "Такім чынам, прыміце праект GraphQl StarWars Explorer, дзе кадзіраванне сустракаецца з сілай. Гэта мудрагелістая прыгода, у якой вы хутка будзеце казаць: «Няхай запыты будуць з вамі» і смяяцца, як вясёлы Вукі.",
        "course-1": "Курс",
        "course-2": "RS School React курс",
        "course-3": "Курс React бясплатны і онлайн!",
        "text-7": "Курс RS School React працуе па прынцыпе pay it forward. Члены нашай суполкі бясплатна дзеляцца сваімі ведамі і правяраюць заданні студэнтаў. І мы спадзяемся, што нашы студэнты будуць працягваць гэтую працу ў якасці нашых настаўнікаў у будучыні.",
        "text-8": "Вучыцца ў RS School можа кожны, незалежна ад узросту, прафесійнай занятасці і месца жыхарства. Аднак перад пачаткам праграмы вы павінны мець дастатковыя базавыя веды.",
        "text-9": "Пасля завяршэння адукацыі студэнты атрымаюць электронны сертыфікат аб заканчэнні."
    },
    "welcomeSlider": {
        "text-1": "Прадстаўляем распрацоўшчыкаў праекта, пярэстую каманду бунтароў, якія валодаюць кодам, і нягоднікаў, якія валодаюць тэхналогіямі! З іх пальцамі, якія лётаюць па клавіятурах на звышхуткаснасці, яны ствараюць праект, які больш магутны, чым армія дроідаў-астрамеханікаў, і смешней, чым нязграбнасць Джара-Джара Бінкса.",
        "text-2": "Распрацоўшчык праграмнага забеспячэння, які працуе ў сакрэтнай арганізацыі, якая супрацьстаіць злым імператару. Яна можа пісаць код на розных мовах, уключаючы дроідаў і вукі. Яна таксама мае ўладу, якая дазваляе ёй мець зносіны з іншымі распрацоўшчыкамі выдалена і ўплываць на іх рашэнні. Яна не баіцца сутыкацца з цяжкасцямі і памылкамі, заўсёды гатовая дапамагчы сваім калегам. Яна марыць стварыць праграму, якая зможа знішчыць зорку смерці - галоўная зброя імператара.",
        "text-3": "Можа пісаць код хутчэй, чым Хан Сола можа зрабіць Kessel Run менш чым за дванаццаць парсек - уражвае, нават для пілота Millennium Falcon! Як і ў R2-D2, навыкі ліквідацыі непаладак гэтага распрацоўшчыка легендарныя. Гэтак жа, як і Обі-Ван Кенобі, гэты распрацоўшчык валодае здольнасцю настаўляць і накіроўваць малодшых членаў каманды, фармуючы іх у рыцараў-джэдаяў царства кадавання.",
        "text-4": "Распрацоўшчык праграмнага забеспячэння, які працуе ў сакрэтнай арганізацыі, якая супрацьстаіць злым імператару. Ён можа пісаць код на любой мове, уключаючы дроідаў, вукі і эвок. Таксама ён валодае сілай, якая дазваляе ўзломваць любыя сістэмы бяспекі і кіраваць рознымі механізмамі. Ён не баіцца сутыкацца з цяжкасцямі і памылкамі, і заўсёды гатовы дапамагчы сваім сябрам. Ён марыць стварыць праграму, якая зможа знішчыць зорку смерці - галоўная зброя імператара."
    },
    "error": {
        "text-1": "На жаль... Нешта пайшло не так.",
        "text-2": "Памылка зменных",
        "text-3": "Няправільны аб'ект зменных",
        "text-4": "Памылка загалоўкаў",
        "text-5": "Загаловак Аўтарызацыя павінен пачынацца з Bearer",
        "text-6": "Токен у загалоўку Аўтарызацыя павінен быць больш за 10 сімвалаў",
        "text-7": "Токен у загалоўку Аўтарызацыя павінен быць карацей за 20 сімвалаў",
        "text-8": "Няправільны загаловак Access-Control-Allow-Origin",
        "text-9": "Няправільны загаловак Access-Control-Allow-Credentials",
        "text-10": "Няправільны загаловак Accept"
    }
}
